#---------------------------------------------------ДВУМЕРНЫЕ МАССИВЫ -----------------------------------------------

A = [ [0]*M for i in range(N)]# ПРАВИЛЬНОЕ ГЕНЕРАЦИЯ ДВУМЕРНОГО МАССИВА
A[0] == A[1] # TRUE
A[o] is A[1] # FASLE ОПЕРАТОР IS СРАВНИВАЕТ НЕ ПО ИМЕНИ А ПО ССЫЛКАМ ДВУХ ОБЕКТОВ

#--------------------------------НАЙБОЛЬШАЯ ОБЩАЯ ПОДПОСЛЕДОВАТЕЛЬНОСТЬ---------------------------------------

def largest_common_sub(A, B):
    F = [[0]*(len(B)+1) for i in range(len(A)+1)]
    for i in range(1, len(A)+1):
        for j in range(1, len(B)+1):
            if A[i-1] == B[j-1]:
                F[i][j]=1+F[i-1][j-1]
            else:
                F[i][j] == max(F[i-1][j], F[i][j-1])
    return F[-1][-1]

#-------------------------------------НАЙБОЛЬШАЯ ВОЗРАСТАЮЩАЯ ПОДПОСЛЕДОВАТЕЛЬНОСТЬ-------------------------------

def gis(A):
    F = [0]*(len(A)+1)
    for i in range(1,len(A)+1):
        m = 0
        for j in range(0, i ):
            if A[i]>A[j] and F[j]>m:
                m = F[j]
        F[i] = m+1
    return F[len(A)]
